import React, {useState} from 'react';
import school from "./../../../images/school.png"
import child from "./../../../images/students.png"
import book from "./../../../images/book.png"
import teach from "./../../../images/teach.png"
import {media} from "../../media";

const Info = () => {

    const [modal, setModal] = useState(false)

    return (
        <section id="info">
            <div className="container">
                <div className="info-general__width"/>
                <div className="info-general">
                    <div className="info-general__block">
                        <div style={{width: media(250, 625), height: media(190, 438), margin: media(10, 25)}}/>
                        <img src={school} alt="img" style={{width: media(250, 625), height: media(190, 438)}}/>
                    </div>
                    <div className="info-general__block2">
                        <h1>Мектеп тууралуу маалымат</h1>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={child} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Учурдагы окуучулар</h2>
                                <h3>142</h3>
                            </div>
                        </div>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={book} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Жалпы китептердин саны</h2>
                                <h3>3481</h3>
                            </div>
                        </div>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={teach} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Учурдагы мугалимдер</h2>
                                <h3>26</h3>
                            </div>
                        </div>
                    </div>
                </div>
                <div className="info-general2">
                    {/*<p style={{fontSize: media(16, 18)}}> Чоё-Алай райондук билим бер\\ бъл\м\нъ караштуу Садыбакас*/}
                    {/*    Осмонов атындагы орто мектебинин т\птъл\\ тарыхы жън\ндъ МААЛЫМАТ</p>*/}
                    <button
                        onClick={() => setModal(true)}
                    >Толук маалымат
                    </button>
                    {modal && (
                        <div className="info-general2__modal">
                            <div className="info-general2__modal__block">
                                <h1 onClick={() => setModal(false)}>Жабуу</h1>
                                <p>
                                    Чоң-Алай райондук билим берүү бөлүмүнө караштуу Садыбакас Осмонов атындагы орто
                                    мектебинин түптөлүү тарыхы жөнүндө маалымат Чоң-Алай райондук билим берүү бөлүмүнө
                                    караштуу Садыбакас Осмонов атындагы орто мектеби Чулук айылына 2003-жылдары элдик
                                    ашар жолу менен курулуп баштап, 2005-жылы 26-сентябрда пайдаланууга берилген.Ага
                                    чейин айылдын жаштары, окуучулары Жекенди айылындагы «Кыргызстан» орто мектебине
                                    каттап окушкан.Дээрлик 5 км узундуктагы жол азабы, Чоё-Алайдын климаттык катаал
                                    шарты айылдын жашоочуларын ойлондурбай койгон эмес.Ошентип, айылдын активдүү жаштары
                                    жана нарктуу каарылары кеңешип, айылга кичинекей болсо да ашар жолу менен билим
                                    уясын, маданий борборду куруу керектигин кеңешишет да тиешелүү иштерди баштап, билим
                                    уясын бүтүрүшөт.Өзгөчө ошол учурда Улуу Ата Мекендик согуштун ардагери Осмонов
                                    Садыбакас, Бакыбеков Жунус, Кудайбердиев Мамади,Жаркынбаев Маматкул, Жаркынбаев
                                    Мамыт,Ташмаматов Парпи аксакалдар лидер болуп, элдин башын бириктирип, бири дубалын
                                    койсо, бири койун сойуп берип, дагы бири жыгачын чогултуп жүрүп, 2005-жылдын
                                    26-сентябрында мотурайган жаш бөбөктөрдүн билимге умтулган жалындуу көздөрүнө
                                    кубаныч тартуулап, келечекке болгон үмүт отун жандырууга себепчи болушкан…
                                    2005-жылдын 26-сентябры.Бул күн Чулук айылынын жашоочулары, мотурайган жаш бөбөктөрү
                                    үчүн өзгөчө күн эле.Мектеп жаңы ачылганда өзүнүн мыкты сапаттары менен айырмаланган
                                    кыргыз тили жана адабияты мугалими, азыркы учурда Чоң-Алай райондук мамлекеттик
                                    администрация башчысынын орун басары Бакыбеков Бекназар директорлук кызматты
                                    аркалап,өзүнүн лидерлик сапатын көрсөтө алса, Окуу бөлүмүнүн башчысы болуп
                                    Куттугалиев Жээнбай, тарбиялык иштер боюнча директордун орун басары кызматына
                                    Учурдагы Чоң-Алай райондук билим берүү бөлүмүнүн башчысы Бактыбаев Пазыл
                                    Мисиратиллаевич дайындалып, окуучуларга чоң дем-күч беришкен. 201 (эки жүз бир)
                                    окуучуга 12 (он эки) гана мугалим билим берип баштаган.2006-жылдын май айында
                                    директор Бакыбеков Бекназар башка ишке которулгандыгына байланыштуу жумуштан
                                    кеткендиктен, мектептин директору болуп Куттугалиев Жээнбай агай
                                    дайындалган.Предметтик мугалимдер жетишпегенине карабай мектеп окуучулары райондук
                                    олимпиадаларга, сынактарга активдүү катышып, алдыңкы орундарга жетишсе, мугалимдер
                                    да чыгармачылык менен иштешип , райондогу алдыңкы мугалимдердин катарын толуктап
                                    келишкен.Мектеп окуучулары чашке тамагын ичүүчү ашкана жок болгондуктан мектеп
                                    директору Куттугалиев Жээнбайдын сунушу жана мектеп жамаатынын колдоосу, айыл
                                    тургундарынын активдүү аракеттери менен мектепке 20 (жыйырма) орундуу ашкана
                                    курулган.Андан кийин Куттугалиев Жээнбай агай кызматын өз каалоосу менен 2009-жылы
                                    тапшыргандыгына байланыштуу мектептин директору болуп Анапияев Шермамат агай
                                    дайындалган. Анапияев Шермамат агай 2009-жылдын апрел айында Жекенди айылдык
                                    аймагынын башчысы болуп дайындалгандыгына байланыштуу кызматтан кеткен.Ошол эле жылы
                                    2009-жылдын апрелинде мектептин директору кызматына биология мугалими Ташмаматов
                                    Кубанычбек дайындалган. Ташмаматов Кубанычбек ишке келгенден кийин мектептин
                                    материалдык техникалык базасын чыңдоодо ийгиликтүү иштерди аткарды.Атап айтсак,
                                    2011-2012-окуу жылында китепкана жана директор үчүн тайын кабинет, 2015-2016-окуу
                                    жылында мектепке 100 орундуу заманбап актовый залдын имараты курулуп ишке берилди
                                    жана бүгүнкү күнү Спорттук залдын пайдубалы курулду.2018-жылдын 22-июнь айында
                                    билим, илим кызматкерлеринин кесиптик бирлигинин Чоё-Алай райондук комитетинин
                                    търагасы болуп шайлангандыгына байланыштуу кызматын тапшырды.2018-жылдын сентябрь
                                    айынан тарта мектептин орус тили жана адабияты мугалими Бакыбеков Төрөбай директор
                                    болуп эмгектенген. 2021-жылдын ноябрь айынан баштап ротация жолу менен жаёыдан иш
                                    билги жетекчи Омурзаков Абылкасым Катанович дайындалган.Учурда мектепте 142 (жүз
                                    кырк эки) окуучуга 25 (жыйырма беш) жогорку билимдүү, кесипкөй мугалимдер билим
                                    берип, талыкпай эмгектенип келе жатышат.
                                    [Переслано от Mad Bee]
                                    Мектеп ишке берилгенден бери 16 (он алты) жыл аралыгында бүтүрүүчү окуучуларыбыз
                                    жогорку окуу жайларга окуп, билим алышып, бири Ош шаардык мериясында пресс катчы
                                    болсо, бири мугалим, дагы бири дарыгер жана жеке ишкерлик мен
                                </p>
                            </div>
                        </div>
                    )}
                </div>
            </div>
        </section>
    );
};

export default Info;